tutorials/multiphase/potentialFreeSurfaceDyMFoam/oscillatingBox/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    freeSurface
    {
        type            pressureInletOutletParSlipVelocity;
        value           uniform (0 0 0);
    }

    ".*Wall"
    {
        type            noSlip;
    }

    "floatingObject.*"
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
